Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/conditional-rendering_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: conditional-rendering title: Conditional Rendering permalink: docs/conditional-rendering.html prev: handling-events.html next: lists-and-keys.html redirect_from:
ja: --- id: conditional-rendering title: 条件付きレンダー permalink: docs/conditional-rendering.html prev: handling-events.html next: lists-and-keys.html redirect_from:

source: In React, you can create distinct components that encapsulate behavior you need.
ja: React ではあなたの必要なふるまいをカプセル化した独立したコンポーネントを作ることができます。

source: Then, you can render only some of them, depending on the state of your application.
ja: そして、あなたのアプリケーションの状態に応じて、その一部だけを描画することが可能です。

source: Conditional rendering in React works the same way conditions work in JavaScript.
ja: React における条件付きレンダーは JavaScript における条件分岐と同じように動作します。

source: Use JavaScript operators like [`if`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/if...else) or the [conditional operator](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Conditional_Operator) to create elements representing the current state, and let React update the UI to match them.
ja: [`if`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/if...else) もしくは[条件演算子](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Conditional_Operator)のような JavaScript 演算子を使用して現在の状態を表す要素を作成すれば、React はそれに一致するように UI を更新します。

source: Consider these two components:
ja: 以下の 2 つのコンポーネントを考えてみましょう：

source: We'll create a `Greeting` component that displays either of these components depending on whether a user is logged in:
ja: ユーザがログインしているかどうかによって、これらのコンポーネントの一方だけを表示する `Greeting` コンポーネントを作成しましょう：

source: This example renders a different greeting depending on the value of `isLoggedIn` prop.
ja: この例では `isLoggedIn` プロパティの値によって異なる挨拶メッセージを表示します。

source: ### Element Variables {#element-variables}
ja: ### 要素変数 {#element-variables}

source: You can use variables to store elements.
ja: 要素を保持しておくために変数を使うことができます。

source: This can help you conditionally render a part of the component while the rest of the output doesn't change.
ja: これは、出力の他の部分を変えずにコンポーネントの一部を条件付きでレンダーしたい時に役立ちます。

source: Consider these two new components representing Logout and Login buttons:
ja: ログアウトとログインボタンを表す以下の 2 つの新しいコンポーネントを考えましょう：

source: In the example below, we will create a [stateful component](/docs/state-and-lifecycle.html#adding-local-state-to-a-class) called `LoginControl`.
ja: 以下の例では、`LoginControl` という[ステート付きコンポーネント](/docs/state-and-lifecycle.html#adding-local-state-to-a-class)を作成します。

source: It will render either `<LoginButton />` or `<LogoutButton />` depending on its current state.
ja: `LoginControl` は現在の state によって `<LoginButton />` もしくは `<LogoutButton />` の一方をレンダーします。

source: It will also render a `<Greeting />` from the previous example:
ja: 加えて、前の例の `<Greeting />` もレンダーします：

source: While declaring a variable and using an `if` statement is a fine way to conditionally render a component, sometimes you might want to use a shorter syntax.
ja: 変数を宣言して `if` 文を使用することはコンポーネントを条件的にレンダーするなかなか良い方法ではありますが、より短い構文を使いたくなる時もあります。

source: There are a few ways to inline conditions in JSX, explained below.
ja: 以下で述べるように、JSX でインラインで条件を記述する方法がいくつか存在します。

source: ### Inline If with Logical && Operator {#inline-if-with-logical--operator}
ja: ### 論理 && 演算子によるインライン If {#inline-if-with-logical--operator}

source: You may [embed expressions in JSX](/docs/introducing-jsx.html#embedding-expressions-in-jsx) by wrapping them in curly braces.
ja: 中括弧で囲むことで、[JSX に式を埋め込む](/docs/introducing-jsx.html#embedding-expressions-in-jsx)ことができます。

source: This includes the JavaScript logical `&&` operator.
ja: これには JavaScript の論理 `&&` 演算子も含まれます。

source: It can be handy for conditionally including an element:
ja: これは条件に応じて要素を含めたいというときに便利です。

source: It works because in JavaScript, `true && expression` always evaluates to `expression`, and `false && expression` always evaluates to `false`.
ja: これが動作するのは、JavaScript では `true && expression` は必ず `expression` と評価され、`false && expression` は必ず `false` と評価されるからです。

source: Therefore, if the condition is `true`, the element right after `&&` will appear in the output.
ja: 従って、条件部分が `true` であれば、`&&` の後に書かれた要素が出力に現れます。

source: If it is `false`, React will ignore and skip it.
ja: もし `false` であれば、React はそれを無視して飛ばします。

source: Note that returning a falsy expression will still cause the element after `&&` to be skipped but will return the falsy expression.
ja: falsy な値を返した場合、`&&` の後の要素の評価はスキップされますが、falsy な値そのものは返されるということに注意してください。

source: In the example below, `<div>0</div>` will be returned by the render method.
ja: 以下の例では `<div>0</div>` がレンダーメソッドから返されます。

source: ### Inline If-Else with Conditional Operator {#inline-if-else-with-conditional-operator}
ja: ### 条件演算子によるインライン If-Else {#inline-if-else-with-conditional-operator}

source: Another method for conditionally rendering elements inline is to use the JavaScript conditional operator [`condition ?
ja: 条件的に要素をレンダーするもうひとつの方法は JavaScript の [`condition ?

source: true : false`](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Conditional_Operator).
ja: true : false`](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Conditional_Operator) 条件演算子を利用することです。

source: In the example below, we use it to conditionally render a small block of text.
ja: 以下の例では条件演算子を用いて、条件に応じてテキストの小さなブロックをレンダーします。

source: It can also be used for larger expressions although it is less obvious what's going on:
ja: より大きな式にも適用することができますが、何が起こっているのか分かりづらくはなります：

source: Just like in JavaScript, it is up to you to choose an appropriate style based on what you and your team consider more readable.
ja: 普通の JavaScript を書くときと同様、あなたとチームが読みやすいと思えるものに合わせて、適切なスタイルを選択してください。

source: Also remember that whenever conditions become too complex, it might be a good time to [extract a component](/docs/components-and-props.html#extracting-components).
ja: 条件が複雑になりすぎたら、[コンポーネントを抽出](/docs/components-and-props.html#extracting-components)するべきタイミングかもしれない、ということにも留意してください。

source: ### Preventing Component from Rendering {#preventing-component-from-rendering}
ja: ### コンポーネントのレンダーを防ぐ {#preventing-component-from-rendering}

source: In rare cases you might want a component to hide itself even though it was rendered by another component.
ja: 稀なケースですが、他のコンポーネントによってレンダーされているにも関わらず、コンポーネントが自分のことを隠したい、ということがあるかもしれません。

source: To do this return `null` instead of its render output.
ja: その場合はレンダー出力の代わりに `null` を返すようにしてください。

source: In the example below, the `<WarningBanner />` is rendered depending on the value of the prop called `warn`.
ja: 以下の例では、`<WarningBanner />` バナーは `warn` と呼ばれるプロパティの値に応じてレンダーされます。

source: If the value of the prop is `false`, then the component does not render:
ja: そのプロパティの値が `false` なら、コンポーネントはレンダーされません：

source: Returning `null` from a component's `render` method does not affect the firing of the component's lifecycle methods.
ja: コンポーネントの `render` メソッドから `null` を返してもコンポーネントのライフサイクルメソッドの発火には影響しません。

source: For instance `componentDidUpdate` will still be called.
ja: 例えば `componentDidMount` は変わらず呼び出されます。
